<template>
    <p class="descr">В чём же отличие абсолютной позиции? Здесь точно так же могут применяться свойства <span>top, right, bottom, left</span>. Однако, смещение происходит не относительно стандартного положения элемента, а относительно краев элемента, внутри которого он находится, но только если у этого большего элемента задана позиция relative. Если же у элемента, внутри которого находится размещаемый элемент, позиция не relative, поиски идут дальше, к еще большему элементу, который содержит в себе элемент, содержащий позиционируемый элемент... И так далее. Если ни один элемент с позицией relative не находится, то наш элемент размещается относительно body, потому что для body позиция по умолчанию - relative. Кроме того, наш элемент будто бы сбегает из основного кода и теперь существует в другом измерении - он освобождает своё прежнее место, как будто его там и не было, и другие элементы могут его занять.
    <br><br>Попробуй сместить элемент на 50 пикселей от верхнего края раздела с визуальной частью и на 30 - от левого края.
    </p>
</template>

<script>
export default {

}
</script>

<style scoped>
.descr{
    width: 100%;
    height: fit-content;
    font-size: 17px;
}
span{
    background-color: rgb(255, 180, 0);
    border-radius: 5px; 
    padding: 0 5px;
}
.example{
    font-style: italic;
    background-color: rgb(255, 130, 0);
}
</style>