<template>
    <p class="descr">Мы уже разобрались, как выровнять элементы по основной оси. Но как же подвинуть стоящие в столбик элементы влево или вправо, или опустить строчку с элементами пониже? С этим справляется <b>align-items</b> - свойство, которое выстраивает элементы <i>вспомогательной оси</i>, то есть по вертикали, если элементы располагаются в строчку (по умолчанию), и по горизонтали, если элементы расположены в столбик. Здесь есть небольшие отличия: flex-start, flex-end, center, baseline, stretch
    <ul>
        <li><b>flex-start</b> - элементы прижимаются к началу (к верхнему краю, если всё в строчку, влево, если всё в столбик);</li>
        <li><b>flex-end</b> - элементы располагаются в конце;</li>
        <li><b>center</b> - элементы встают посередине;</li>
        <li><b>baseline</b> - элементы выстраиваются так, чтобы их содержимое (например, текст) находилось на одной линии;</li>
        <li><b>stretch</b> - элементы растягиваются, чтобы занять всё свободное место (всю строчку, если они стоят в столбик, или весь столбец, если они расположены в ряд).</li>
    </ul> Для начала попробуй разные варианты и посмотри, чем они отличаются.
    <br><br>А теперь включи флекс, расположи элементы в самой середине: в центре как по горизонтали, так и по вертикали.
    </p>
</template>

<script>
export default {

}
</script>

<style scoped>
.descr{
    width: 100%;
    height: fit-content;
    font-size: 17px;
}
span{
    background-color: rgb(255, 180, 0);
    border-radius: 5px; 
    padding: 0 5px;
}
ul li{
    font-size: 17px;
    list-style-type: disc;
    margin-left: 40px;
}
.example{
    font-style: italic;
    background-color: rgb(255, 130, 0);
}
</style>