<template>
    <p class="descr">Молодец! Давай попробуем разобраться с одним из самых сложных значений в свойстве <b>align-items</b>. Оно выравнивает элементы по их содержимому. Сейчас в блоках записан текст, причем в каждом блоке он занимает разную высоту. Если включить флекс, мы увидим, что текст в блоках выравнивается по центру, и именно эта линия является главной осью. Попробуй разные значения, увидишь, что везде текст будет начинаться с разной высоты, но "серединками" все блоки будут совпадать.
    <br><br>А теперь попробуй разместить элементы так, чтобы они выравнивались по тексту - все надписи начинались бы с одной строки, на одном уровне.
    </p>
</template>

<script>
export default {

}
</script>

<style scoped>
.descr{
    width: 100%;
    height: fit-content;
    font-size: 24px;
}
</style>