<template>
    <p class="descr">Если тобой уже изучена тема переходов, то изучение следующих нескольких уровней по анимации не вызовет у тебя трудностей. Очередным свойством анимации является <b>animation-duration</b>, отвечающее за длительность анимации. Указывается, конечно же, время в секундах. Ключевые кадры расставляются именно внутри этого времени: если длительность анимации - 4 секунды, то 0% = 0ая секунда, 50% = 2ая секунда, 100% = 4ая секунда. Если длительность анимации - 6 секунд, то её середина придется уже на 3ью секунду, соответственно, изменения будут применяться медленнее, более плавно.
    <br><br> Укажи длительность анимации 5 секунд. Не забудь указать и имя желаемой анимации: <i>fly</i> или <i>isparenie</i>.
    </p>
</template>

<script>
export default {

}
</script>

<style scoped>
.descr{
    width: 100%;
    height: fit-content;
    font-size: 24px;
}
span{
    background-color: rgb(255, 180, 0);
    border-radius: 5px; 
    padding: 0 5px;
}
.example{
    font-style: italic;
    background-color: rgb(255, 130, 0);
}
</style>