<template>
    <p class="descr">Последнее свойство для анимации, которое мы разберём - это <b>animation-fill-mode</b>. Это свойство помогает указать, что происходит с элементом, когда анимация не проигрывается, например, после окончания анимации. Для этого свойства есть несколько значений:
    <ul>
        <li><b>none</b> - никакие новые стили не применяются;</li>
        <li><b>forwards</b> - по окончании анимации у элемента остаётся стиль последнего ключевого кадра;</li>
        <li><b>backwards</b> - к элементу сразу же применяется стиль первого ключевого кадра, который остается на протяжении всего времени, указанного в delay (задержка);</li>
        <li><b>both</b> - forwards + backwards: сразу и на всё время задержки применяются стили первого ключевого кадра, а по окончании анимации остаются стили последнего ключевого кадра.</li>
    </ul>Попробуй все варианты и посмотри, чем они отличаются.
    <br><br>А для перехода к последнему уровню в анимации укажи название анимаци (<i>isparenie</i> или <i>fly</i>), укажи для неё 1 повтор и примени такое свойство и его значение, чтобы стили сохранились и после завершения анимации - совёнок исчезнет или перелетит в правую часть экрана и останется там.
    </p>
</template>

<script>
export default {

}
</script>

<style scoped>
.descr{
    width: 100%;
    height: fit-content;
    font-size: 18px;
}
a{
    text-decoration: none;
    color: rgb(255, 90, 0);
    font-weight: bold;
}
a:hover {
    color: black;
}
ul li{
    font-size: 18px;
    list-style-type: disc;
    margin-left: 40px;
}
span{
    background-color: rgb(255, 180, 0);
    border-radius: 5px; 
    padding: 0 5px;
}
.example{
    font-style: italic;
    background-color: rgb(255, 130, 0);
}
</style>