<template>
    <p class="descr"><b>Animation-direction</b> позволяет задать направление анимации, чаще всего используется при её неоднократном воспроизведении. Какие есть возможные варианты направлений?
    <ul>
        <li><b>normal</b> - значение по умолчанию, анимация воспроизводится так, как указано в ключевых кадрах. Как только доходит до последнего кадра, переключается на первый, то есть резко меняет свойства с указанных в 100% на указанные в 0%;</li>
        <li><b>reverse</b> - анимация воспроизводится наоборот: от свойств, указанных в 100% идет к 0%. Как только заканчивается первый повтор, моментально переходит к 100% и снова проигрывается до 0%;</li>
        <li><b>alternate</b> - направление меняется на каждом повторе: сначала воспроизводится от 0% до 100%, затем от 100% до 0%, потом снова от 0% до 100% и так далее. Создаются плавные переходы;</li>
        <li><b>alternate-reverse</b> - направление меняется на каждом повторе: сначала воспроизводится от 100% до 0%, затем от 0% до 100%, потом снова от 100% до 0% и так далее. Создаются плавные переходы, но в обратном порядке.</li>
    </ul>
    <br>Попробуй запустить анимацию <i>fly</i> в обратном порядке. Обрати внимание, откуда сова начинает лететь.
    </p>
</template>

<script>
export default {

}
</script>

<style scoped>
.descr{
    width: 100%;
    height: fit-content;
    font-size: 18px;
}
a{
    text-decoration: none;
    color: rgb(255, 90, 0);
    font-weight: bold;
}
a:hover {
    color: black;
}
ul li{
    font-size: 18px;
    list-style-type: disc;
    margin-left: 40px;
}
span{
    background-color: rgb(255, 180, 0);
    border-radius: 5px; 
    padding: 0 5px;
}
.example{
    font-style: italic;
    background-color: rgb(255, 130, 0);
}
</style>