<template>
    <p class="descr">Но иногда нужен более точный выбор цвета, например, не просто красный, а конкретный оттенок красного, чуть более темный или же яркий. На помощь приходит <b>HEX</b>-формат записи цвета. Это такой способ представления цвета через числа и буквы, к примеру, красный цвет в таком виде записывается как <span class="example">#FF0000</span>. Первые два символа после # отвечают за содержание красного цвета в выбранном, следующие два - за содержание зеленого цвета, последние два - за синий цвет. Дело в том, что все цвета могут быть получены за счет смешивания красного, зеленого и синего в разных пропорциях. Но самостоятельно подбирать нужные пропорции тяжело, чтобы выбрать подходящий цвет, можно использовать созданные для этого сайты, можешь найти их в интернете, вот тебе <a href="https://htmlcolorcodes.com/" target="_blank">пример</a>. На данном сайте ты можешь выбрать нужный цвет, а затем его оттенок, и увидеть сверху подходящий набор букв и цифр рядом с надписью HEX. Справа от такого представления есть еще RGB и HSL, но с ними мы поработаем на следующих уровнях. 
    <br><br> Попробуй указать цвет фона в формате HEX - #8F89FF, и посмотри, какой цвет получится.
    </p>
</template>

<script>
export default {

}
</script>

<style scoped>
.descr{
    width: 100%;
    height: fit-content;
    font-size: 20px;
}
span{
    background-color: rgb(255, 180, 0);
    border-radius: 5px; 
    padding: 0 5px;
}
a{
    text-decoration: none;
    color: rgb(255, 90, 0);
    font-weight: bold;
}
a:hover {
    color: black;
}
.example{
    font-style: italic;
    background-color: rgb(255, 130, 0);
}
</style>