<template>
    <p class="descr">Еще один способ задания цвета - <b>RGB</b>. Такой формат записи тоже представлен на сайте из <a href="https://htmlcolorcodes.com/" target="_blank">примера</a>. Название RGB выбрано не случайно - это первые буквы слов red, green, blue - красный, зеленый, и синий - трех основных цветов, смешивая которые, можно получить любой другой цвет. Для того, чтобы указать цвет в таком формате, необходимо указать формат rgb, а в скобках "пропорции" нужных цветов от 0 до 255, где 0 - данный цвет не используется, 255 - максимально возможное использование цвета. Например, голубой цвет можно указать так: <span>background-color: rgb(110, 210, 255);</span>. Но и здесь можно выбрать цвет ещё подробнее, указав ещё один параметр - <i>альфа-канал</i>, а по-простому - <b>непрозрачность</b>. Значение для непрозрачности указывается от 0 до 1, где 0 - полностью прозрачный цвет (его совсем не будет видно), 1 - полностью непрозрачный, обычный. Можно указать, например, 0.5 - тогда цвет будет наполовину(на 50%) прозрачным, через него будет просвечивать то, что находится позади, внизу. Чтобы это сделать, нужно записать уже не просто rgb, а именно <i><b>rgba</b></i>:  <span class="example">background-color: rgba(110, 210, 255, 0.5);</span>
    <br><br> Попробуй указать цвет фона в формате rgba. Используй красный цвет в соотношении 190, зеленый - 255, синий - 130, и установи непрозрачность 70%. 
    </p>
</template>

<script>
export default {

}
</script>

<style scoped>
.descr{
    width: 100%;
    height: fit-content;
    font-size: 20px;
}
span{
    background-color: rgb(255, 180, 0);
    border-radius: 5px; 
    padding: 0 5px;
}
a{
    text-decoration: none;
    color: rgb(255, 90, 0);
    font-weight: bold;
}
a:hover {
    color: black;
}
.example{
    font-style: italic;
    background-color: rgb(255, 130, 0);
}
</style>