<template>
    <p class="descr">Следующее значение позиции - <b>fixed</b>, или фиксированная. Точно так же, как для абсолютной позиции, с помощью свойств <span>top, right, bottom, left</span> задается местоположение элемента. Разница состоит в том, что этот элемент всегда остается на выбранном месте, даже при прокрутке страницы, когда все остальные элементы сдвигаются - будто бы он находится не на сайте, а просто "прилеплен" к экрану компьютера. 
    <br><br>Давай попробуем так закрепить элемент в правой нижней части экрана: необходимо "оттолкнуться" от нижнего края на 50 пикселей, и от правого края - тоже на 50 пикселей. Попробуй полистать блок с визуалом, обрати внимание, что элемент так и останется неподвижным.
    </p>
</template>

<script>
export default {

}
</script>

<style scoped>
.descr{
    width: 100%;
    height: fit-content;
    font-size: 17px;
}
span{
    background-color: rgb(255, 180, 0);
    border-radius: 5px; 
    padding: 0 5px;
}
.example{
    font-style: italic;
    background-color: rgb(255, 130, 0);
}
</style>