<template>
    <p class="descr">По умолчанию все цвета распределяются равномерно, чтобы получался плавный переход. Конечно же, не всегда нужна такая равномерность, и это можно исправить, указав, какую <b>часть</b> должен занимать каждый цвет. Например, если мы используем 4 цвета, то изначально каждый из них занимает по 25% элемента. Мы же можем это исправить: <span class="example">background: linear-gradient(90deg, red 50%, yellow 60%, green 90%, blue 100%);</span>. Теперь половину фона займет красный цвет, затем плавно начнет переходить в желтый, но совсем на небольшом расстоянии, потому что желтый цвет будет занимать место только от 50 до 60%, а дальше начнется плавный переход в зеленый, который продлится почти до конца фона - в самой правой части останется немного места под переход в синий. Таким образом с помощью процентов можно указывать желаемую долю каждого цвета, но можно использовать и другие варианты соотношений, например, указывать значение в пикселях.
    <br><br> Попробуй указать соотношения цветов для фона из прошлого задания (градиентного под углом 45 градусов, с переходом между цветами: #B460FF, #AD84FF, #4D7DFF, #4DE4FF). Теперь первый цвет будет занимать 40% фона, второй продлится до 55%, третий - до 65%, а закончится градиент четвертым цветом. 
    </p>
</template>

<script>
export default {

}
</script>

<style scoped>
.descr{
    width: 100%;
    height: fit-content;
    font-size: 20px;
}
span{
    background-color: rgb(255, 180, 0);
    border-radius: 5px; 
    padding: 0 5px;
}
.example{
    font-style: italic;
    background-color: rgb(255, 130, 0);
}
</style>