<template>
    <p class="descr">А тебе когда-нибудь приходила мысль о том, что фоны могут накладываться друг на друга, и их может быть несколько? На самом деле, это так! Для этого нужно указать несколько вариантов через запятую внутри одного свойства background. Но чтобы несколько фонов могли соединяться, необходимо, чтобы каждый был хотя бы слегка прозрачным. Ты уже разбираешься в цветах, поэтому знаешь, что можно просто использовать RGBA и указывать последнее число меньше единицы, чтобы добавить немного прозрачности цвету. Очень большой пример: <span class="example">background: radial-gradient(circle at 50% 0, rgba(255, 0, 0, 0.5), rgba(255, 0, 0, 0) 75%), radial-gradient(circle at 5% 75%, rgba(0, 0, 255, 0.5), rgba(0, 0, 255, 0) 75%), radial-gradient(circle at 95% 75%, rgba(0, 255, 0, 0.5), rgba(0, 255, 0, 0) 75%) beige;</span>. Если рассмотреть его по частям: задаётся фон из трёх круговых градиентов и бежевого цвета. Первый круговой градиент - красного цвета от 50% прозрачности до полностью прозрачного цвета, и располагается в верхней части экрана. Второй: от полупрозрачного синего до полностью прозрачного, в левом нижнем углу экрана. Третий - от полупрозрачного зеленого до полностью прозрачного в правом нижнем углу. Все они накладываются друг на друга для получения градиентного фона из трех цветов!
    <br><br>Изучи пример внимательно, скопируй и примени, чтобы посмотреть результат.
    </p>
</template>

<script>
export default {

}
</script>

<style scoped>
.descr{
    width: 100%;
    height: fit-content;
    font-size: 19.5px;
}
span{
    background-color: rgb(255, 180, 0);
    border-radius: 5px; 
    padding: 0 5px;
}
.example{
    font-style: italic;
    background-color: rgb(255, 130, 0);
}
</style>