<template>
    <p class="descr">Но даже после указания соотношений цветов переходы остаются плавными, а иногда нам нужен "резкий", полосатый фон, чтобы цвета <b>не смешивались</b>. В таком случае цветам нужно прописывать и момент начала, и окончания цвета в процентах. Это значит, что для того, чтобы цвета сменялись резко, <i>точка окончания одного цвета должна совпадать с точкой начала другого</i>. Если же нужно, чтобы цвета очень плавно переходили из одного в другой, между точкой окончания первого цвета и точкой начала второго должно быть <i>очень большое расстояние</i>. Например: <span class="example">background: linear-gradient(90deg, red 10%, yellow 10% 30%, green 70% 80%, blue 95% 100%);</span>. Проверь такие значения: мы увидим красную полоску, после которой сразу начинается желтая, и никаких переходов - ведь точка 10% совпадает для красного и желтого цвета. Затем около 20% занимает желтый цвет, после чего начинается долгий плавный переход в зеленый - от 30 до 70% происходит переход, а вот в точке 70% начинается зеленый цвет. 
    <br><br>Укажи градиентный фон, где угол наклона - 30 градусов, используется красный цвет до 15%, затем желтый - от 75 до 90 %, и розовый с 90%.
    </p>
</template>

<script>
export default {

}
</script>

<style scoped>
.descr{
    width: 100%;
    height: fit-content;
    font-size: 20px;
}
span{
    background-color: rgb(255, 180, 0);
    border-radius: 5px; 
    padding: 0 5px;
}
.example{
    font-style: italic;
    background-color: rgb(255, 130, 0);
}
</style>