<template>
    <p class="descr">Цвет фона может быть и <b>градиентным</b>, то есть сочетать в себе несколько цветов и плавно переходить от одного к другому. Чтобы установить такие настройки, необходимо указать свойство <b>background</b>, а не background-color, то есть более общее, которое сочетает в себе несколько разных значений, которые мы рассмотрим в следующих уровнях. После указания свойства нужно задать нужное значение - это <b>linear-gradient</b>, а далее указать угол наклона и все используемые цвета по порядку - их может быть сколько угодно. Например, градиентный фон, где цвета будут располагаться как вертикальные полосы слева направо - под углом 90 градусов, с переходом от желтого к красному, а затем к розовому можно задать так: <span class="example">background: linear-gradient(90deg, yellow, red, pink);</span>. Цвета можно задавать в любом формате: словом, HEX, RGB... Направление вместо градусов можно также указывать словами - <span>to top, to right, to bottom, to left</span>. 
    <br><br> Давай сделаем градиентный фон по диагонали - под углом 45 градусов, с переходом между цветами: #B460FF, #AD84FF, #4D7DFF, #4DE4FF.
    </p>
</template>

<script>
export default {

}
</script>

<style scoped>
.descr{
    width: 100%;
    height: fit-content;
    font-size: 20px;
}
span{
    background-color: rgb(255, 180, 0);
    border-radius: 5px; 
    padding: 0 5px;
}
.example{
    font-style: italic;
    background-color: rgb(255, 130, 0);
}
</style>