<template>
    <p class="descr">По умолчанию круги располагаются <b>по центру</b> элемента, в самой серединке. Но эту точку тоже можно двигать! Для этого внутри скобок необходимо прописать нужное положение нового центра кругов, используя слово <b>at</b>. Это можно сделать разными способами, один из самых легких - проценты. Первое число будет указывать перемещение по горизонтали, где 0% - левый край, а 100% - правый. Второе число отвечает за перемещение по вертикали, где 0% - верх, 100% - низ. Например, <span class="example">background: radial-gradient(at 10% 70%, red 20%, yellow 40%);</span> переместит центр кругов в левую нижнюю часть элемента. Точно так же перемещение можно указывать в пикселях, или же словами top, right, bottom или left. 
    <br><br>Попробуй создать градиентный круговой фон, используя оранжевый (orange) цвет в точке 40%, и красный (red) цвет с точкой в 60%, и сместив центр на 20 пикселей от левого края и на 25% от верхнего.
    </p>
</template>

<script>
export default {

}
</script>

<style scoped>
.descr{
    width: 100%;
    height: fit-content;
    font-size: 22px;
}
span{
    background-color: rgb(255, 180, 0);
    border-radius: 5px; 
    padding: 0 5px;
}
.example{
    font-style: italic;
    background-color: rgb(255, 130, 0);
}
</style>