<template>
    <p class="descr">Использование нескольких цветов возможно не только в "полосатом" виде - могут использоваться и другие фигуры, например, <b>круг</b>. Для такого фона необходимо прописать значение <b>radial-gradient</b> и точно так же указывать подходящие цвета и точки их начала и окончания при необходимости. Цвета будут располагаться кругами, начиная с небольшого в центре элемента и увеличиваясь к его краям.
    <br><br>Укажи градиентный круговой фон, используя светло-голубой (lightblue) цвет и точку 100 пикселей для него, сиреневый (violet) цвет с точкой в 50% и ярко-розовый (magenta) с точкой 70%. 
    </p>
</template>

<script>
export default {

}
</script>

<style scoped>
.descr{
    width: 100%;
    height: fit-content;
    font-size: 24px;
}
span{
    background-color: rgb(255, 180, 0);
    border-radius: 5px; 
    padding: 0 5px;
}
</style>