<template>
    <p class="descr">Очень часто фон задаётся с помощью изображений, поэтому важно изучить свойства, позволяющие работать с картинками в фоне. Первое свойство, с которым мы познакомимся - <b>background-repeat</b>. Оно указывает, как именно нужно повторять картинку, если она меньше, чем блок, для которого она является фоном. Здесь есть множество вариантов:
    <ul>
        <li><b>repeat-x</b> - размер изображения не изменяется, картинки выстраиваются в строчку, чтобы заполнить ширину блока (если что-то не влезает, часть картинки обрезается);</li>
        <li><b>repeat-y</b> - размер изображения не изменяется, картинки выстраиваются в столбик, чтобы заполнить высоту блока (если что-то не влезает, часть картинки обрезается);</li>
        <li><b>repeat</b> - размер изображения не изменяется, картинки выстраиваются и в строчки, и в столбике, и как мозаика заполняют весь блок (если что-то не влезает, часть картинки обрезается);</li>
        <li><b>space</b> - размер изображения не изменяется, картинки выстраиваются и в строчки, и в столбики, столько раз, сколько влезут. Первый и последний элементы обязательно прижаты к краям, картинки не обрезаются; </li>
        <li><b>round</b> - картинки выстраиваются и в строчки, и в столбики, столько раз, сколько влезут. Оставшееся место заполняется за счет того, что картинки растягиваются в этом направлении;</li>
        <li><b>no-repeat</b> - картинка не повторяется, используется в одном экземпляре.</li>
    </ul><br>Всё разберём подробнее, а начнём давай с того, что ты выстроишь фоновые изображения в строчку.
    </p>
</template>

<script>
export default {

}
</script>

<style scoped>
.descr{
    width: 100%;
    height: fit-content;
    font-size: 18px;
}
ul li{
    font-size: 18px;
    list-style-type: disc;
    margin-left: 40px;
}
span{
    background-color: rgb(255, 180, 0);
    border-radius: 5px; 
    padding: 0 5px;
}
.example{
    font-style: italic;
    background-color: rgb(255, 130, 0);
}
</style>