<template>
    <p class="descr">Следующее свойство, которое поможет нам выстраивать элементы - <b>justify-content</b>. Оно отвечает за расположение элементов по <i>основной оси</i>. Основная ось - это горизонтальная, если элементы располагаются в строчку (по умолчанию), и вертикальная, если элементы расположены в столбик. И здесь есть много разных вариантов: 
    <ul>
        <li><b>flex-start</b> - элементы прижимаются к самому началу (к левому краю, если всё в строчку, кверху, если всё в столбик);</li>
        <li><b>flex-end</b> - элементы располагаются в конце;</li>
        <li><b>center</b> - элементы встают посередине;</li>
        <li><b>space-between</b> - элементы занимают всю ось (строчку или столбик), первый элемент прижат к началу, последний - к концу, а если есть другие, то расстояние между всеми элементами делится поровну;</li>
        <li><b>space-around</b> - элементы занимают всю ось (строчку или столбик), между элементами одинаковые расстояния, а от первого и последнего элемента до стенок - половина от этого расстояния;</li>
        <li><b>space-evenly</b> - элементы занимают всю ось (строчку или столбик), все расстояния одинаковые - и между элементами, и до начала, и до конца.</li>
    </ul> Прежде чем приступать к заданию, примени каждый из этих вариантов и посмотри, как они устроены.
    <br><br>Для начала давай сдвинем элементы к левому краю. Не забудь "подключить" flex. 
    </p>
</template>

<script>
export default {

}
</script>

<style scoped>
.descr{
    width: 100%;
    height: fit-content;
    font-size: 17px;
}
span{
    background-color: rgb(255, 180, 0);
    border-radius: 5px; 
    padding: 0 5px;
}
ul li{
    font-size: 17px;
    list-style-type: disc;
    margin-left: 40px;
}
.example{
    font-style: italic;
    background-color: rgb(255, 130, 0);
}
</style>