<template>
    <p class="descr"> Зачастую возникает необходимость в равных отступах сверху и снизу, а также равных отступах по бокам. Это также можно сделать при помощи общего свойства <b>margin</b>, где будет указано только <b>два значения</b> через пробел. Первое - значение для <b>верхнего и нижнего</b> отступов, второе - для отступов <b>по бокам.</b> <br><br> Укажи внешние отступы сверху и снизу на 10 пикселей и отступы по бокам по 30 пикселей.
    </p>
</template>

<script>
export default {

}
</script>

<style scoped>
.descr{
    width: 100%;
    height: fit-content;
    font-size: 24px;
}
span{
    background-color: rgb(255, 180, 0);
    border-radius: 5px; 
    padding: 0 5px;
}
</style>