<template>
    <p class="descr"><b>Matrix</b> - сложное свойство для модификации элемента, которое соединяет в себе несколько других, которые мы уже изучили. Порядок записи следующий:
    <span>scaleX, skewY, skewX, scaleY, translateX, translateY</span>. Например, для того, чтобы растянуть элемент в 2 раза в ширину, деформировать его относительно оси Х на 1.5, а относительно оси У - на 0.5, сплющить его высоту так, чтобы она стала 70% от текущей, а также сдвинуть его на 30 пикселей вправо и на 20 вверх, можно записать всего одно свойство: <span class="example">transform: matrix(2, 0.5, 1.5, 0.7, 30, -20);</span>. Главное - не ошибиться в порядке свойств!
    <br><br>
        Воспользуйся <i>одним</i> свойством и попробуй указать увеличение ширины в 1.2 раза, увеличение высоты - в 2 раза, деформацию по оси Y на 0, по оси X на 1.5, движение вправо на 70 пикселей и вверх на 50 пикселей. 
    </p>
</template>

<script>
export default {

}
</script>

<style scoped>
.descr{
    width: 100%;
    height: fit-content;
    font-size: 20px;
}
span{
    background-color: rgb(255, 180, 0);
    border-radius: 5px; 
    padding: 0 5px;
}
.example{
    font-style: italic;
    background-color: rgb(255, 130, 0);
}
</style>