<template>
    <p class="descr"><b>Position</b> - свойство, которое помогает разместить элемент и даже задать способ его взаимодействия с соседними элементами. Какие же позиции бывают для элементов?
    <ul>
        <li><b>static</b> - значение по умолчанию, стандартный порядок расположения элементов;</li>
        <li><b>relative</b> - относительное размещение, можно сдвинуть элемент относительно его текущего положения;</li>
        <li><b>absolute</b> - абсолютное позиционирование, мы сами выбираем место для элемента и он "исчезает" для своих прошлых "соседей", его старое место занимают;</li>
        <li><b>fixed</b> - место для элемента всегда одинаковое, он никуда не сдвинется даже при пролистывании;</li>
        <li><b>sticky</b> - элемент начинает вести себя как fixed с определенного момента.</li>
    
    </ul> Остановимся поподробнее на втором варианте - <b>relative</b>. Кроме того, что нужно указать свойству <b>position</b> такое значение, необходимо также указать, куда сдвигать наш элемент. Здесь применяется одно или несколько из 4 свойств: <span>top, right, bottom, left</span>. Для используемого свойства указывается значение в пикселях или процентах, в том числе может указываться отрицательное значение. Например,
    <br><span class="example">position: relative;<br>top: 30px;<br>left: -20px;</span> сдвинет элемент на 30 пикселей вниз (от верхнего края) и на 20 пикселей влево (-20 от левого края).
    <br><br>Попробуй сместить элемент на 50 пикселей вверх и на 30 - влево.
    </p>
</template>

<script>
export default {

}
</script>

<style scoped>
.descr{
    width: 100%;
    height: fit-content;
    font-size: 17px;
}
span{
    background-color: rgb(255, 180, 0);
    border-radius: 5px; 
    padding: 0 5px;
}
ul li{
    font-size: 17px;
    list-style-type: disc;
    margin-left: 40px;
}
.example{
    font-style: italic;
    background-color: rgb(255, 130, 0);
}
</style>