<template>
    <p class="descr"><b>Sticky</b> очень похож на fixed. Элемент точно так же "закрепляется" на экране и остаётся неподвижным. Но это происходит только с определённого момента, до достижения которого элемент сдвигается вместе со всеми остальными. Например, если указать<br> <span class="example">position: sticky;<br>left: 50px;</span>, то элемент сначала будет вести себя так же, как и с позицией по умолчанию, двигаться вместе со всеми элементами при прокрутке страницы <i>вправо</i>, но как только расстояние от элемента до левого края уменьшится до 50 пикселей, элемент остановится и "прилипнет", как будто ему указали фиксированную позицию, дальше он не будет двигаться. Если же страницу начать прокручивать обратно, <i>влево</i>, и расстояние от элемента до левого края снова начнет превышать 50 пикселей, элемент снова будет сдвигаться как при обычной позиции.
    <br><br> Проверь: сделай элемент прилипающим к верхней части страницы, как только до неё остается меньше 20 пикселей.
    </p>
</template>

<script>
export default {

}
</script>

<style scoped>
.descr{
    width: 100%;
    height: fit-content;
    font-size: 17px;
}
span{
    background-color: rgb(255, 180, 0);
    border-radius: 5px; 
    padding: 0 5px;
}
.example{
    font-style: italic;
    background-color: rgb(255, 130, 0);
}
</style>