<template>
    <p class="descr"><b>Transition</b> - это способ управлять изменением различных свойств элемента, переходом из одного состояния в другое. Пример: реализована смена фона элемента с оранжевого на белый, и увеличение размера элемента в два раза при наведении на него мышкой (про смену свойств при наведении мыши можно прочитать <a href="https://webref.ru/css/hover" target="_blank">здесь</a>). Если не использовать свойство <b>transition</b>, то при наведении мыши новые свойства применятся моментально. Если же его использовать, то можно будет настроить скорость применения этих свойств, задержку, плавность и прочее. Начнём с первого свойства, которое можно задать: <b>transition-property</b>. Он указывает, для каких именно свойств элемента применяются настройки их изменения. Для приведенного выше примера можно изменять вместе и фон, и размер, а можно сделать так, что цвет фона сменится моментально, а для изменения размера элемента (ширины и высоты) уже будут применяться настройки. Значит, следует так и указать: <span class="example">transition-property: width, height;</span>. 
    <br><br>Попробуй проверить приведенный пример, но наоборот. Пусть размер элемента меняется сразу, а вот цвет фона - плавно.
    </p>
</template>

<script>
export default {

}
</script>

<style scoped>
.descr{
    width: 100%;
    height: fit-content;
    font-size: 20px;
}
a{
    text-decoration: none;
    color: rgb(255, 90, 0);
    font-weight: bold;
}
a:hover {
    color: black;
}
ul li{
    font-size: 20px;
    list-style-type: disc;
    margin-left: 40px;
}
span{
    background-color: rgb(255, 180, 0);
    border-radius: 5px; 
    padding: 0 5px;
}
.example{
    font-style: italic;
    background-color: rgb(255, 130, 0);
}
</style>