<template>
    <p class="descr">В другом же порядке разница будет заметна невооруженным глазом. Если сначала выполнять поворот элемента, а затем сдвигать его, то <b>будут поворачиваться и оси</b>. То есть, если повернуть элемент на 30 градусов по часовой стрелке, то вертикальная ось будет распологаться уже не <span> | так</span>, а <span>/ так</span>. Соответственно, при использовании translateY элемент будет двигаться уже не вверх и вниз, а по диагонали. Точно так же развернется и горизонтальная ось. Важно это учитывать, проверь!
    <br><br>
    Попробуй самостоятельно: теперь сначала поверни элемент на 90 градусов, а только потом сдвинь его на 100 пикселей вправо и на 30 вниз. 
    </p>
</template>

<script>
export default {

}
</script>

<style scoped>
.descr{
    width: 100%;
    height: fit-content;
    font-size: 20px;
}
span{
    background-color: rgb(255, 180, 0);
    border-radius: 5px; 
    padding: 0 5px;
}
.example{
    font-style: italic;
    background-color: rgb(255, 130, 0);
}
</style>