<template>
    <p class="descr">Последний способ установить <b>transition-timing-function</b> для переходов - "шагами": <span class="example">transition-timing-function: steps(3, jump-start);</span>. Вместо jump-start может использоваться и другая команда из этого списка:
    <ul>
        <li><b>jump-start</b> - выполняет переход за указанное количество "прыжков". Первый совершается сразу, остальные - с равными промежутками времени за указанное время перехода;</li>
        <li><b>jump-end</b> - выполняет переход за указанное количество "прыжков". Прыжки совершаются с равными промежутками времени за указанное время перехода так, что последний прыжок происходит в самый последний момент перехода;</li>
        <li><b>jump-none</b> - выполяется указанное количество "прыжков" с равными промежутками времени, в самом начале и самом конце перехода прыжки не совершаются (фактически вместо 3 прыжков совершается 2 и т.д.);</li>
        <li><b>jump-both</b> - выполяется указанное количество "прыжков" с равными промежутками времени, в том числе в самом начале и самом конце перехода (фактически вместо 3 прыжков совершается 4 и т.д.).</li>
    </ul>Проверь разные варианты и посмотри, чем они отличаются.
    <br><br>Попробуй указать выполнение перехода за 5 прыжков, чтобы последний прыжок выполнялся в последний момент перехода.
    </p>
</template>

<script>
export default {

}
</script>

<style scoped>
.descr{
    width: 100%;
    height: fit-content;
    font-size: 18px;
}
a{
    text-decoration: none;
    color: rgb(255, 90, 0);
    font-weight: bold;
}
a:hover {
    color: black;
}
ul li{
    font-size: 18px;
    list-style-type: disc;
    margin-left: 40px;
}
span{
    background-color: rgb(255, 180, 0);
    border-radius: 5px; 
    padding: 0 5px;
}
.example{
    font-style: italic;
    background-color: rgb(255, 130, 0);
}
</style>